src/Documents/УстановкаОсобыхУсловийОтсрочки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаОсобыхУсловийОтсрочки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОсобыеУсловияОтсрочки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзготовителиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоставкиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсобыеУсловия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Изготовитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоставки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимоеЧислоДнейЗадолженности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчетаДней</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыРасчетаДней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/УстановкаОсобыхУсловийОтсрочки/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Документы.УстановкаОсобыхУсловийОтсрочки.ВыполнитьПроведение(Ссылка, Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Документы.УстановкаОсобыхУсловийОтсрочки.ВыполнитьОтменуПроведения(Ссылка, Отказ);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Дата <> НачалоДня(Дата) Тогда
		Дата = НачалоДня(Дата);
	КонецЕсли;
	
	ЗаполнитьРеквизитыСтроковыхПредставлений();
	
КонецПроцедуры

Процедура  ЗаполнитьРеквизитыСтроковыхПредставлений()
	
	ЗаполнитьИзготовителиСтрокой();	
	ЗаполнитьТипПоставкиСтрокой();
	
КонецПроцедуры

Процедура  ЗаполнитьИзготовителиСтрокой()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Изготовители.Изготовитель
	|ПОМЕСТИТЬ Изготовители
	|ИЗ
	|	&Изготовители КАК Изготовители
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРЕДСТАВЛЕНИЕ(Изготовители.Изготовитель) КАК Изготовитель
	|ИЗ
	|	Изготовители КАК Изготовители";
	
	Запрос.УстановитьПараметр("Изготовители", ОсобыеУсловия.Выгрузить(,"Изготовитель"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИзготовителиСтрокой_Нов = "";
	Пока Выборка.Следующий() Цикл
		ИзготовителиСтрокой_Нов = ИзготовителиСтрокой_Нов + ?(ИзготовителиСтрокой_Нов = "", "", ", ") + Выборка.Изготовитель;
	КонецЦикла;
	
	Если ИзготовителиСтрокой <> ИзготовителиСтрокой_Нов Тогда
		ИзготовителиСтрокой = ИзготовителиСтрокой_Нов;
	КонецЕсли;
	
КонецПроцедуры

Процедура  ЗаполнитьТипПоставкиСтрокой()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипыПоставки.ТипПоставки
	|ПОМЕСТИТЬ ТипыПоставки
	|ИЗ
	|	&ТипыПоставки КАК ТипыПоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРЕДСТАВЛЕНИЕ(ТипыПоставки.ТипПоставки) КАК ТипПоставки
	|ИЗ
	|	ТипыПоставки КАК ТипыПоставки";
	
	Запрос.УстановитьПараметр("ТипыПоставки", ОсобыеУсловия.Выгрузить(,"ТипПоставки"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипПоставкиСтрокой_Нов = "";
	Пока Выборка.Следующий() Цикл
		ТипПоставкиСтрокой_Нов = ТипПоставкиСтрокой_Нов + ?(ТипПоставкиСтрокой_Нов = "", "", ", ") + Выборка.ТипПоставки;
	КонецЦикла;
	
	Если ТипПоставкиСтрокой <> ТипПоставкиСтрокой_Нов Тогда
		ТипПоставкиСтрокой = ТипПоставкиСтрокой_Нов;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры
